#include "language.h"


const  QMap<QString,QString> language::config{{"A100","已获取客户号"},
                                              {"A101","已获取公司名"}};
const  QMap<QString,QString> language::info{{"A110","数据库已连接"},
                                            {"A210","数据库已关闭"},
                                            {"A310","程序初始化成功"},
                                            {"A410","已获取客户信息"},
                                            {"A111","开始验证数据库"},
                                            {"A211","主数据库未发现异常"},
                                            {"A311","审计数据库未发现异常"},
                                            {"A411","主数据库自动修复成功"},
                                            {"A112","审计数据库自动修复成功"},
                                            {"A212","尝试第"},
                                            {"A312","次修复"},
                                            {"A412","开始修复数据库"},
                                            {"A113","修复已执行"},
                                            {"A213","验证修复"},
                                            {"A313","开始备份数据库"},
                                            {"A413","修复已执行"},
                                            {"A114","验证修复"},
                                            {"A214","开始备份数据库"},
                                            {"A314","主数据库已备份"},
                                            {"A414","审计数据库已备份"},
                                            {"A115","开始系统检测"},
                                            {"A215","正在搜集系统监测信息"},
                                            {"A315","系统检测完毕"},
                                            {"A415","开始主磁盘健康检查"},
                                            {"A116","正在收集主磁盘健康检查信息"},
                                            {"A216","主磁盘健康检查完毕"},
                                            {"A316","生成报告"},
                                            {"A416","清理临时文件"},
                                            {"A117","结束程序"}};
const  QMap<QString,QString> language::warning{{"A120","未获取数据库连接对象"},
                                               {"A121","未获取客户号"},
                                               {"A122","未获取公司名"},
                                               {"A123","主数据库未找到"},
                                               {"A124","审计数据库未找到"},
                                               {"A125","主数据库未备份"},
                                               {"A126","审计数据库未备份"}};
const  QMap<QString,QString> language::severe{{"A130","程序初始化失败"},
                                              {"A230","获取客户信息失败"},
                                              {"A330","主数据库发现错误"},
                                              {"A131","审计数据库发现错误"},
                                              {"A231","主数据库无法自动修复"},
                                              {"A331","审计数据库无法自动修复"},
                                              {"A132","主数据库无法验证"},
                                              {"A232","审计数据库无法验证"},
                                              {"A332","数据库无法自动修复"},
                                              {"A133","主数据库无法备份"},
                                              {"A233","审计数据库无法备份"}};


language::language()
{

}

